app/Controllers/Forms.php

public function forms()
    {
        $product = new FormsModel();
        $file = $this->request->getFile('file');

        if ($file->isValid() && ! $file->hasMoved()) {
            $imageName = $file->getName();
            $file->move('public/uploads/', $imageName);
        }
        $data =[
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
            'posttitle' => $this->request->getPost('posttitle'),
            'city' => $this->request->getPost('city'),
            'Textarea' => $this->request->getPost('Textarea'),
            'category' => $this->request->getPost('category'),
            'file' => $imageName,
        ];
        $product->save($data);
---
INSERT INTO `forms` (`name`, `email`, `posttitle`, `city`, `Textarea`, `category`, `file`) VALUES ('kritika soni', '2020pcecskhushi114@poornima.org', 'hello', 'gangapur', 'uyguyguyguyguy', 'international', '1st sem cert..jpeg')