app/Controllers/Register.php

public function register()
{
    die();
if (! $this->validate([
    'username' => 'required',
    'password' => 'required|min_length[10]',
    'name' => 'required',
    'email' => 'required|valid_email',
])) {
        return view('pages/admin/pages-register',[ 'validation' => $this->validator,]);
    }
    else
    {
        $data = [ 'name'=> $this->request->getVar('name'),
        'username'=> $this->request->getVar('username'),
        'password'=> $this->request->getVar('password'),
        'email'=> $this->request->getVar('email')];
        $model = new RegisterModel();
        $model->insert($data);
---
INSERT INTO `register` (`name`, `username`, `password`, `email`) VALUES ('khushi sharma ', 'pu0001', '925081cb0cdb070425520c2b55781d89', '2020pcecskhushi114@poornima.org')